{
    "home": {
        "carousel": [
            {
                "src": "img\/slideshow\/slideshow0.jpg",
                "caption": "Universidad Nacional de la Patagonia San Juan Bosco"
            },
            {
                "src": "img\/slideshow\/slideshow1.jpg",
                "caption": "Universidad Nacional de la Patagonia San Juan Bosco"
            },
            {
                "src": "img\/slideshow\/slideshow2.jpg",
                "caption": "Universidad Nacional de la Patagonia San Juan Bosco"
            },
            {
                "src": "img\/slideshow\/slideshow3.jpg",
                "caption": "Universidad Nacional de la Patagonia San Juan Bosco"
            }
        ],
        "sections": [
            {
                "title": "Misión",
                "content": "<p>Este grupo busca fortalecer la vinculación entre el sistema científico-tecnológico y la estructura productiva en el ámbito de la informática y las telecomunicaciones para afrontar los nuevos desafíos que se proponen con la transformación digital, buscando generar con ello un impacto positivo en las actividades de la Cuenca del Golfo San Jorge.<\/p><p>Sus líneas de investigación se centran en el procesamiento digital de señales que utilizan los sistemas sensoriales desplegados en espacios inteligentes, redes eléctricas y entornos subacuáticos para percibir el estado del entorno y las entidades con las cuales se interactúa en estos.<\/p><p>En el caso de redes eléctricas las investigaciones se enfocan en el procesamiento de señales para sistemas de comunicaciones por línea eléctrica (PLC), particularmente  las técnicas de sincronización de tramas y estimación de canal en esquemas de modulacion de multiplexación por división de frecuencia ortogonal (OFDM). Esta línea incluye además el diseño de símbolos piloto que permitan reducir la complejidad computacional en comparación con los esquemas actuales de sincronización y estimación.<\/p> <p>En el caso de los espacios inteligentes y entornos acústicos subacuáticos poco profundos, las investigaciones se centran en el  procesamiento de señales acústicas codificadas. Se enfocan los esfuerzos en el diseño de esquemas de codificación que aporten robustez frente al ruido, que permitan que múltiples usuarios coexistan en un mismo entorno e incrementar la precisión en la determinación de los instantes de llegada de las señales. Este tipo de sistemas son utilizados en redes de sensores subacuáticos para el monitoreo costero, y también por vehículos autónomos subacuáticos (AUVs).<\/p> <p>Otras de las lineas de investigación esta orientada al desarrollo de soluciones utilizando herramientas TICs (hardware y software) para el monitoreo oceanográfico y el análisis de los datos que se obtienen a través de diferentes sistemas sensoriales, campañas oceanográficas y relevamientos costeros.<\/p><p>Además, las actividades del grupo incluyen la evaluación e implementación en dispositivos programables, como las FPGA, de nuevos banco de filtros de transceptores de modulación multiportadora de última generación para sistemas PLC, así como los mencionados algoritmos para el esquema OFDM con señales acústicas. <\/p>"
            }
        ]
    },
    "group": {
        "members": {
            "cdemarziani": {
                "name": "Carlos De Marziani",
                "degree": "Doctor",
                "position": "Profesor Titular UNPSJB, Inv. Adjunto CONICET",
                "pic": "img\/profiles\/cdemarziani.jpg",
                "desc": "El Dr. Carlos De Marziani obtuvo, en el año 2001, el título de Ingeniero Electrónico en la Universidad Nacional de la Patagonia San Juan Bosco (Argentina). En el año 2007, obtuvo el título de Doctor en el Departamento de Electrónica de la Universidad de Alcalá (España). Actualmente se desempeña como Profesor Titular en el área de Sistemas Digitales en el Departamento de Electrónica de la Universidad Nacional de la Patagonia San Juan Bosco. Además es Investigador Adjunto en el Consejo Nacional de Investigaciones Científicas y Técnicas (CONICET). Sus áreas de investigación son redes de sensores, integración multisensorial, sistemas electrónicos para robots y procesamiento digital de señales. Participa en diferentes proyectos de investigación científica con financiamiento público de entidades nacionales. Actualmente dirige dos tesis doctorales. Ha publicado numerosos artículos en congresos científicos a nivel nacional e internacional; como así también artículos en revistas indexadas con alto índice de impacto.",
                "contact": {
                    "email": "marziani@unpata.edu.ar",
                    "linkedin": ""
                }
            },
            "mcolombo": {
                "name": "Martín Colombo",
                "degree": "Doctor",
                "position": "Profesor Adjunto",
                "pic": "img\/profiles\/mcolombo.jpg",
                "desc": "El Dr. Martín Colombo obtuvo el título de Ingeniero Electrónico en la Universidad Nacional de la Patagonia San Juan Bosco (Argentina) en el año 2014. En el año 2021 obtuvo el título de Doctor en Ingeniería por la Universidad Nacional de La Plata (Argentina) y Doctor en Electrónica: Sistemas Electrónicos Avanzados, Sistemas Inteligentes por la Universidad de Alcalá de Henares (España) en cotutela. Actualmente se desempeña como Profesor Adjunto en el área de Sistemas de Comunicaciones en el Departamento de Electrónica de la Universidad Nacional de la Patagonia San Juan Bosco. Sus áreas de investigación actuales son sistemas de comunicaciones digitales, comunicaciones por la red eléctrica, y procesamiento digital de señales para sistemas de comunicaciones.",
                "contact": {
                    "email": "mcolombo@ing.unp.edu.ar",
                    "linkedin": ""
                }
            },
            "smurano": {
                "name": "Santiago Murano",
                "degree": "ffffffffff",
                "position": "Jefe de Trabajos Prácticos PRUEBA",
                "pic": "img\/profiles\/smurano.jpg",
                "desc": "Santiago obtuvo el título de Ingeniero Electrónico en la Universidad Nacional de la Patagonia San Juan Bosco en 2012, el título de Máster en Sistemas Electrónica Avanzados. Sistemas Inteligentes en la Universidad de Alcalá (España), y el homónimo ",
                "contact": {
                    "email": "smurano@unpata.edu.ar",
                    "linkedin": "https:\/\/www.linkedin.com\/company\/google\/?originalSubdomain=ar"
                }
            },
            "droldos": {
                "name": "Dario Roldos",
                "degree": "pruebap",
                "position": "",
                "pic": "img\/profiles\/droldos.jpg",
                "desc": ".....",
                "contact": {
                    "email": "roldos.dario@gmail.com",
                    "linkedin": ""
                }
            },
            "ralcoleas": {
                "name": "Rómulo Alcoleas",
                "degree": "",
                "position": "",
                "pic": "img\/profiles\/ralcoleas.jpg",
                "desc": ".....",
                "contact": {
                    "email": "romuloalcoleas@yahoo.com",
                    "linkedin": ""
                }
            },
            "acolombo": {
                "name": "Alejandro Colombo",
                "degree": "Hola",
                "position": "",
                "pic": "img\/profiles\/acolombo.jpg",
                "desc": ".....",
                "contact": {
                    "email": "acolombo1958@gmail.com",
                    "linkedin": ""
                }
            },
            "jaskenazi": {
                "name": "Javier Askenazi",
                "degree": "",
                "position": "",
                "pic": "img\/profiles\/jaskenazi.jpg",
                "desc": "Inserto cosas acá para probar",
                "contact": {
                    "email": "javier.askenazi@gmail.com",
                    "linkedin": ""
                }
            },
            "jgallardo": {
                "name": "José Gallardo",
                "degree": "PRUEBAS",
                "position": "Prof. titular regular",
                "pic": "img\/profiles\/jgallardo.jpg",
                "desc": "José I. Gallardo nació en Paraná, Argentina en 1957. Ingeniero Electrónico de la Univ. Nac. Rosario (1981), Posgrado de Ingeniería en Telecomunicaciones- Escuela Superior Técnica Gral. Savio (Actual IESE), Bs Aires (1983) y de Ingeniería en Comunicaciones Digitales de J.I.C.A.-Japón en Inictel, Lima-Perú (1986). Cursó además Maestría Redes Datos en Univ. Nac. de La Plata. Desempeñó funciones técnicas en proyectos de obras en ENTel \/ Telefónica Arg. en diferentes zonas del país (1981-1996). Jefe del Centro O&M\/Patagonia de Telefónica Arg., responsable aceptaciones, puesta en marcha y mantenimiento de las primeras centrales digitales en la región (1990-1996). Profesor Titular por Concurso en dos asignaturas e Investigador Cat.3 en Deptos. Informática y Electrónica-Fac.Ingeniería-UNPSJB desde 1985. Evaluador de CONEAU en Área Informática desde 2010. Ha dirigido varios proyectos de investigación en las áreas de informática y comunicaciones acústicas subacuáticas desde 1987 a la fecha, con publicaciones en congresos nacionales e internacionales. Asesor en proyectos de teleinformática, redes de VC en la región. Ha sido participante y disertante en numerosas conferencias, en temas como Teleinformática, Comunicaciones por Fibra Óptica, Redes de Computadoras y TCP\/IP. Sus principales campos de interés son comunicaciones digitales, redes de computadoras \/sensores y tecnología informática aplicada en educación.",
                "contact": {
                    "email": "jgallardo@ing.unp.edu.ar",
                    "linkedin": ""
                }
            },
            "prosales": {
                "name": "Pablo Rosales",
                "degree": "Intentos",
                "position": "",
                "pic": "img\/profiles\/prosales.jpg",
                "desc": ".....",
                "contact": {
                    "email": "pablo27207@gmail.com",
                    "linkedin": ""
                }
            },
            "dberns": {
                "name": "Daniel Berns",
                "degree": "Doctor ",
                "position": "xd",
                "pic": "img\/profiles\/dberns.jpg",
                "desc": "xd",
                "contact": {
                    "email": "daniel.w.berns@gmail.com",
                    "linkedin": ""
                }
            },
            "mmicheletto": {
                "name": "Matías Micheletto",
                "degree": "Doctor en Ingeniería",
                "position": "Intentos",
                "pic": "img\/profiles\/mmicheletto.jpg",
                "desc": "Matías Micheletto obtuvo el título de Ingeniero Electrónico y Doctor en Ingeniería en la Universidad Nacional del Sur en 2016 y en 2020 respectivamente. Se desempeñó como Ayudante y más tarde como Asistente de Cátedra en las asignaturas Diseño de Circuitos Lógicos y Técnicas Digitales en el Departamento de Ingeniería Eléctrica y Computadoras entre los años 2016 a 2021. Actualmente se encuentra realizando una Beca Interna Posdoctoral CONICET en el Centro de Investigaciones y Transferencias Golfo San Jorge.",
                "contact": {
                    "email": "matias.micheletto@uns.edu.ar",
                    "linkedin": "https:\/\/www.linkedin.com\/in\/matiasmicheletto"
                }
            },
            "colaborador1": {
                "name": "Colaborador",
                "degree": "Colaborador",
                "position": "Colaborador",
                "pic": "",
                "desc": "Descripción del colaborador",
                "contact": {
                    "email": "colaborador@uns.edu.ar",
                    "linkedin": "https:\/\/www.linkedin.com\/in\/matiasmicheletto"
                }
            }
        },
        "categories": [
            {
                "name": "Miembros del grupo",
                "members": [
                    "cdemarziani",
                    "mcolombo",
                    "smurano",
                    "droldos",
                    "ralcoleas",
                    "acolombo",
                    "jaskenazi",
                    "prosales",
                    "jgallardo",
                    "dberns",
                    "mmicheletto"
                ]
            },
            {
                "name": "Colaboradores del grupo",
                "members": [
                    "colaborador1"
                ]
            }
        ]
    },
    "research": {
        "items": {
            "ir01": {
                "title": "Titulo del trabajo (completar)",
                "authors": "Autores del trabajo (completar)",
                "year": "2022",
                "desc": "",
                "authors_ref": [],
                "section": "internal",
                "links": []
            },
            "mt01": {
                "title": "Titulo de maestria (completar)",
                "authors": "Autores de la maestria (completar)",
                "year": "2022",
                "desc": "Supervised by.....",
                "authors_ref": [],
                "section": "master",
                "links": []
            },
            "pro01": {
                "title": "Titulo de proyecto (completar)",
                "authors": "Autores del proyecto",
                "year": "2022",
                "desc": "",
                "authors_ref": [],
                "section": "projects",
                "links": []
            },
            "transf01": {
                "title": "Titulo de proyecto (completar)",
                "authors": "Autores del proyecto (completar)",
                "year": "2022",
                "desc": "",
                "authors_ref": [],
                "section": "transfers",
                "links": []
            },
            "publ01": {
                "title": " Evaluation of Zadoff-Chu, Kasami and Chirp based  encoding schemes for Acoustic Local Positioning  Systems",
                "authors": " Santiago Murano, Carmen Pérez-Rubio, David Gualda, Fernando J. Álvarez,  Teodoro Aguilera y Carlos De Marziani",
                "year": "2020",
                "desc": "The task of determining the physical coordinates of a target in indoor environments is still a key factor for many applications including people and robot navigation, user tracking, location-based advertising, augmented reality, gaming, emergency response or ambient assisted living environments. Among the different possibilities for indoor positioning, Acoustic Local Positioning Systems (ALPS) have the potential for centimeter level positioning accuracy with coverage distances up to tens of meters. In addition, acoustic transducers are small, low cost and reliable thanks to the room constrained propagation of these mechanical waves. Waveform design (coding and modulation) is usually incorporated into these systems to facilitate the detection of the transmitted signals at the receiver. The aperiodic correlation properties of the emitted signals have a large impact on how the ALPS cope with common impairment factors such as multipath propagation, multiple access interference, Doppler shifting, near-far effect or ambient noise. This work analyzes three of the most promising families of codes found in the literature for ALPS: Kasami codes, Zadoff-Chu and Orthogonal Chirp signals. The performance of these codes is evaluated in terms of time of arrival accuracy and characterized by means of model simulation under realistic conditions and by means of experimental tests in controlled environments. The results derived from this study can be of interest for other applications based on spreading sequences, such as underwater acoustic systems, ultrasonic imaging or even Code Division Multiple Access (CDMA) communications systems.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/document\/8932677"
                ]
            },
            "dt01": {
                "title": "DISEÑO DE SEÑAL BASADO EN CÓDIGOS ZADOFF-CHU PARA SISTEMAS DE POSICIONAMIENTO AÉREOS Y SUBACUÁTICOS AFECTADOS POR DOPPLERDISEÑO DE SEÑAL BASADO EN CÓDIGOS ZADOFF-CHU PARA SISTEMAS DE POSICIONAMIENTO AÉREOS Y SUBACUÁTICOS AFECTADOS POR DOPPLER",
                "authors": "Santiago Murano",
                "year": "2022",
                "desc": "Esta tesis se enfoca al diseño de señal basado en códigos Zadoff-Chu para la mejora de las prestaciones y la robustez de sistemas de posicionamiento ultrasónicos basados en la medida de tiempos de vuelo, tanto en espacios interiores aéreos como en entornos subacuáticos. El uso de estos códigos resulta de especial interés en entornos perjudicados por el efecto Doppler, debido al movimiento relativo entre emisor y receptor, ya que la correlación con estas secuencias aporta mayor robustez a los desplazamientos en frecuencia que los esquemas tradicionales. El método empleado por este tipo de sistemas de posicionamiento, basados en la medida del tiempo de propagación de señales acústicas, resulta adecuado en entornos donde las señales GNSS (Global Navigation Satellite Systems) sufren una mayor atenuación, como en el interior de edificios o en entornos subacuáticos. Así, el sistema aquí planteado da solución a varios tipos de aplicaciones, como el guiado de vehículos, drones o personas en espacios interiores; o vehículos subacuáticos, sensores o buzos debajo del agua. La mayoría de sistemas de posicionamiento en entornos subacuáticos, están basados en la emisión de señales ultrasónicas debido a la baja atenuación que presentan, en comparación con las ondas electromagnéticas. En entornos aéreos, el uso de señales acústicas permite obtener precisiones centimétricas a un bajo costo, aunque reduciendo el área de trabajo de los sistemas de posicionamiento. La codificación de estas señales, aporta además robustez frente al ruido, la multiemisión, y el incremento en la precisión en la medida de tiempos de vuelo. En este sentido, tras el análisis y comparación pormenorizado de los códigos más favorables para este tipo de aplicaciones, se ha enfocado el estudio en los códigos Zadoff-Chu por sus propiedades de autocorrelación (AC) y correlación cruzada (CC) y su robustez frente al Doppler. Para completar el diseño de la señal a transmitir, se requiere de un esquema de modulación que no degrade las propiedades de las secuencias, o bien que su combinación las mejore. En este sentido, se ha propuesto el uso de cuatro esquemas de modulación para permitir el acceso al medio de las secuencias: modulación por desplazamiento de fase (PSK, Phase Shift Keying), por división de frecuencias ortogonales (OFDM), por saltos de frecuencia (FH) o incluso un novedoso esquema a partir de símbolos chirp ortogonales (OCDM). Para la evaluación del desempeño de los esquemas de codificación\/modulación mencionados, se han utilizado modelos matemáticos que describen el comportamiento de diversos efectos en estos entornos de interés, lo que ha permitido simular las emisiones en diferentes situaciones, y comparar los resultados obtenidos en cada esquema a partir del análisis de métricas específicas. Además, se ha contribuido al desarrollo de dos aplicaciones con interfaz gráfica para el usuario, que facilitan las tareas de investigación en el uso de estos modelos de simulación, uno en espacios interiores, y otro considerando los efectos del entorno subacuático. Entre los aportes y\/o contribuciones mas importantes de esta tesis se pueden enumerar: a) Estudio pormenorizado y clasificación de distintos esquemas de codificación y modulación, para el diseño de una señal robusta frente a las interferencias típicas que afectan los sistemas de posicionamiento basados en la medida de tiempos de vuelo. Así, se ha propuesto el uso de secuencias Zadoff-Chu por sus propiedades de AC, CC y robustez al Doppler, y se han analizado cuatro esquemas de modulación para su aplicación en estos sistemas. b) Propuesta de un novedoso esquema de modulación para secuencias Zadoff-Chu empleando simbolos chirp. c) Nuevo método de selección de semillas favoritas para la obtención de secuencias que mejoran las propiedades de AC y CC. d) Estudio exhaustivo del desempeño de estos esquemas en sistemas de posicionamiento basados en la medida de tiempos de vuelo aperiódicos, tanto en espacios aéreos como en entornos subacuáticos. Para el estudio se han modelado los efectos típicos de estos entornos, los cuales además han servido como base para el desarrollo de dos aplicaciones de simulación con interfaz de usuario. e) Diseño de un nuevo algoritmo de detección de picos para la mejora de la medida de tiempos de vuelo en entornos afectados por multicamino. Finalmente, se ha podido comprobar y validar el comportamiento de los esquemas propuestos, tanto por los modelos de simulación, como por las pruebas experimentales realizadas en diferentes entornos, en estático y en movimiento.",
                "authors_ref": "",
                "section": "doctoral",
                "links": [
                    "https:\/\/gestion-doctorado.uah.es\/tesis\/1137"
                ]
            },
            "publ02": {
                "title": "Relative Positioning System Using Acoustic Sensors for Ubiquitous Computing Applications",
                "authors": "Carlos De Marziani, Jesús Ureña, Álvaro Hernández, Manuel Mazo, Ana Jiménez, Fernando Alvarez y J. Manuel Villadangos",
                "year": "2005",
                "desc": "Systems that characterize the state of an entity or object are very important in the “smart spaces” and “ubiquitous computing”; this information is\nusually known as the entity’s \"context\". Those applications, which describe or\ncharacterize these entities and interact with it, are often referred as \"contextaware computing\". One of the most important information is the position of an\nobject with the purpose of offering the most suitable services to him. The\nmechanisms and techniques that determine these space relations are named “location\"; and the computing applications, based on the position, are called “location-aware computing”. This article presents an indoor localization system in\norder to make a relative positioning among entities, fixed or mobile, without\nuse an external infrastructure and only using acoustic transducers for their use\nin ubiquitous computing applications. Also, an analysis of the positioning algorithm, based on multidimensional scaling technique (MDS), is carried out in\norder to verify the errors in the position estimation when there are errors in the\nmechanism of ranging distances. ",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ceur-ws.org\/Vol-132\/paper04.pdf"
                ]
            },
            "publ03": {
                "title": "Advanced sensorial system for an acoustic LPS",
                "authors": "J. Ureña, A. Hernández, A. Jiménez, J.M. Villadangos, M. Mazo, J.C. García, J.J. García, F.J. Álvarez, C. De Marziani, M.C. Pérez, J.A. Jiménez, A.R. Jiménez, F. Seco",
                "year": "2007",
                "desc": "This work presents the development and implementation of a Local Positioning System (LPS) based on the transmission of ultrasonic signals, proposed for indoor positioning of mobile robots. The LPS consists of several ultrasonic beacons located in the environment, all of them emitting periodically and simultaneously. A portable receiver collects all the transmissions and autonomously computes its position. Neither infrared nor radiofrequency are required for synchronization in the localization process, compared to other related works. Direct Sequence Code Division Multiple Access (DS-CDMA) techniques are used to allow simultaneous emission from several beacons; each one transmitting a different 255-bit Kasami code. The portable receiver can detect the time of arrival for the different signals coming from the beacons, by carrying out all the correlations with the emitted codes. Absolute position of the receiver is determined by hyperbolic trilateration, using the Differences in Times-of-Arrival (DTOA) between a reference beacon and the other ones. The main advantage of this proposal is to permit the coexistence of an unlimited number of portable receivers, what is useful in applications like multirobot cooperation.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/www.sciencedirect.com\/science\/article\/abs\/pii\/S0141933107000385"
                ]
            },
            "publ04": {
                "title": "High Reliability Outdoor Sonar Prototype based on Efficient Signal Coding",
                "authors": "Fernando J. Alvarez, Jesus Urena, Manuel Mazo, Alvaro Hernandez, Juan J. Garcia, Carlos De Marziani",
                "year": "2006",
                "desc": "Many mobile robots and autonomous vehicles designed for outdoor operation have incorporated ultrasonic sensors in their navigation systems, whose function is mainly to avoid possible collisions with very close obstacles. The use of these systems in more precise tasks requires signal encoding and the incorporation of pulse compression techniques that have already been used with success in the design of high-performance indoor sonars. However, the transmission of ultrasonic encoded signals outdoors entails a new challenge because of the effects of atmospheric turbulence. This phenomenon causes random fluctuations in the phase and amplitude of traveling acoustic waves, a fact that can make the encoded signal completely unrecognizable by its matched receiver. Atmospheric turbulence is investigated in this work, with the aim of determining the conditions under which it is possible to assure the reliable outdoor operation of an ultrasonic pulse compression system. As a result of this analysis, a novel sonar prototype based on complementary sequences coding is developed and experimentally tested. This encoding scheme provides the system with very useful additional features, namely, high robustness to noise, multi-mode operation capability (simultaneous emissions with minimum cross talk interference), and the possibility of applying an efficient detection algorithm that notably decreases the hardware resource requirements.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/document\/4012870"
                ]
            },
            "publ05": {
                "title": "Hardware Implementation of an Efficient Correlator for Interleaved Complementary Sets of Sequences",
                "authors": "María Carmen Pérez, Jesús Ureña, Alvaro Hernández, Carlos De Marziani, Ana Jiménez, William P. Marnane",
                "year": "2007",
                "desc": "Some sensor systems are characterized by multiple simultaneous aperiodic emissions, with low signal-to-noise ratio and asynchronous detection. In these systems, complementary sets of sequences can be used to encode emissions, due to their suitable auto-correlation and cross-correlation properties. The transmission of a complementary set can be accomplished by interleaving the sequences of the set, generating a macro-sequence which is easily transmitted by a BPSK modulation. The detection of the macrosequence can be performed by means of efficient correlation algorithms with a notably decreased computational load and hardware complexity. This work presents a new hardware design in configurable logic of an efficient correlator for macrosequences generated from complementary sets of sequences. A generic implementation has  been achieved, so the configuration can be changed according to the requirements of the application. The developed correlator has been tested in an ultrasonic pulse compression system in which real-time is needed. However, it is applicable in any multi-sensor or communication system where the goal is to make simultaneous emissions from different independent sources, minimizing mutual interference.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/lib.jucs.org\/article\/28752\/"
                ]
            },
            "publ06": {
                "title": "Modular Architecture for Efficient Generation and Correlation of Complementary Set of Sequences",
                "authors": "Carlos De Marziani, Jesús Ureña, Álvaro Hernández, Manuel Mazo, Fernando J. Álvarez, Juan Jesús García, Patricio Donato",
                "year": "2007",
                "desc": "Golay sequences and complementary sets of sequences have been long studied for their application in multisensor and communication systems. The feasibility of these systems strongly depends on the design of an efficient generator and correlator with the aim of reducing the computational load and hardware complexity. Recursive algorithms, which allow efficient architectures, are available in the case of complementary pairs of sequences and complementary sets of four sequences. This work presents a generalization of these algorithms with the purpose of obtaining complementary sets of M sequences with length L, the number of sequences M being a power of two (M=2 m ), and the length L a power of M (L=2 mN ) with m,Nisin N-{0}. This fact allows an ideal Kroumlnecker delta function of weight MmiddotL in the addition of the autocorrelation functions of the M sequences of the set. Furthermore, the generation of M different mutually orthogonal sets can be obtained. This fact makes their application suitable in simultaneous multiemission systems. With the proposed algorithm, an effective reduction in the number of operations necessary to implement the correlator can be obtained, if it is compared with the straightforward implementation. Also, a regular structure is provided that allows implementation of the generator and\/or the correlator for complementary sets of M sequences, based on the structure for complementary sets of M\/2 sequences The sequence length can also be easily extended to any multiple of M. Finally, the generation and correlation of M different mutually orthogonal complementary sets of M sequences can be immediately derived",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/document\/4156375\/authors"
                ]
            },
            "dt02": {
                "title": "Diseño de estrategias de sincronización y estimación de canal para la mejora de comunicaciones multiportadora en redes inteligentes de energía",
                "authors": "Martín Alejandro Colombo",
                "year": "2021",
                "desc": "En las últimas décadas se ha despertado un creciente interés en los sistemas de comunicaciones por la red eléctrica (Power-Line Communications – PLC) debido a su importante rol en el desarrollo de las redes eléctricas inteligentes. Los canales PLC presentan una marcada selectividad de frecuencia debido al efecto multicamino y diversas fuentes de ruido, lo que conforma un escenario desafiante para el desarrollo de sistemas de comunicaciones confiables. La multiplexación por división de frecuencias ortogonales (Orthogonal Frequency Division Multiplexing - OFDM) se ha propuesto como una solución eficiente para los sistemas PLC debido a su robustez frente a los canales de desvanecimiento selectivo en frecuencia. Sin embargo, los sistemas OFDM requieren de una sincronización adecuada, en conjunto con la estimación y ecualización del canal PLC para un desempeño apropiado. La presente tesis contribuye en el desarrollo de estrategias eficientes de sincronización y estimación de canal para sistemas OFDM-PLC, que representen una disminución en la complejidad asociada respecto a variantes existentes en la literatura, y a su vez mantengan un desempeño competitivo. En primer lugar, se realiza el diseño de un símbolo piloto novedoso construido a partir de pares de secuencias complementarias, bajo el criterio de presentar adecuadas propiedades de correlación, un procesamiento de reducida complejidad, y la flexibilidad necesaria para poder aplicar técnicas de sincronización gruesa basadas en autocorrelación (AC) y correlación cruzada (CC), y efectuar una sincronización fina y estimación de canal a partir de esta última. Con respecto a la sincronización gruesa, se realiza una comparación exhaustiva entre las técnicas basadas en AC y CC en las condiciones particulares del canal PLC. Luego, se desarrolla un algoritmo de sincronización fina a partir de la CC eficiente del símbolo piloto propuesto, en el que los cómputos realizados pueden reutilizarse posteriormente para obtener una estimación de la respuesta al impulso del canal, reduciendo la complejidad del conjunto respecto a un enfoque individual de cada etapa. Se realiza un análisis estadístico de las métricas planteadas en la etapa de sincronización gruesa así como aquellas planteadas en la etapa de sincronización fina, y se derivan umbrales de detección apropiados para los algoritmos de sincronización en cada caso. Finalmente, se evalúa la propuesta de sincronización y estimación de canal conjunta en un escenario de transmisión en el que se limita el número de subportadoras activas a partir de una máscara espectral de compatibilidad electromagnética. Se evalúa la degradación de las propiedades del símbolo piloto propuesto, y a partir de ello se redefinen los umbrales de detección utilizados en las etapas de sincronización gruesa y fina. Se plantea la modificación de la correlación cruzada en el receptor para completar las subportadoras inactivas de manera tal de contrarrestar el efecto nocivo de la máscara espectral en la estrategia de estimación de canal. A lo largo del trabajo se lleva a cabo un análisis de la complejidad asociada al cómputo de los algoritmos propuestos en los distintos escenarios planteados, y se verifica que la propuesta representa una opción de reducida complejidad gracias al diseño del símbolo piloto propuesto y su arquitectura de correlación eficiente.",
                "authors_ref": "",
                "section": "doctoral",
                "links": [
                    "https:\/\/ebuah.uah.es\/dspace\/handle\/10017\/54631"
                ]
            },
            "publ07": {
                "title": "EMFi-based ultrasonic transducer for robotics applications",
                "authors": "Ana Jiménez, Álvaro Hernández, Jesús Ureña, María Carmen Pérez, Fernando J. Álvarez, Carlos De Marziani, Juan Jesús García, J. Manuel Villadangos",
                "year": "2008",
                "desc": "A prototype of an ultrasonic transducer based on electromechanical film (EMFi) is presented, as well as its electronic driving and receiving blocks. The electromechanical film provides a wide bandwidth response, showing enough of a level of sensitivity to allow echo-pulse measurement in the most frequency ranges for robotics applications. Emission patterns are obtained, verifying the correspondence between experimental data and the theoretical piston model. Experimental results show that the EMFi-based transducer can be used as a broadband ultrasonic transducer, allowing transmission from 20 to 200 kHz. The wide bandwidth provided by the transducer is a remarkable advantage for sensor systems using encoded ultrasonic signals with wideband modulation schemes, which require considerably more bandwidth than what conventional transducers allow. In this way, main lobes can be discriminated more easily from sidelobes and crosstalk interference can be reduced.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0924424708004160"
                ]
            },
            "publ08": {
                "title": "Efficient Correlator for LS Codes Generated from Orthogonal CSS",
                "authors": "María Carmen Pérez, Jesús Ureña, Álvaro Hernández, Fernando J. Álvarez, Ana Jiménez, Carlos De Marziani",
                "year": "2008",
                "desc": "This paper presents a novel method to correlate loosely synchronized (LS) codes generated from mutually orthogonal complementary sets of sequences (CSS). The proposed correlator significantly reduces the total number of multiplications and additions to be performed, in comparison with straightforward correlators. This fast correlator, together with the interference free window that LS codes exhibit, make them a good choice for next generation of Wireless communications.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/document\/4640947"
                ]
            },
            "publ09": {
                "title": "Efficient Generation and Correlation of Sequence Pairs With Three Zero-Correlation Zones",
                "authors": "María Carmen Pérez, Jesús Ureña, Álvaro Hernández, Ana Jiménez, Carlos De Marziani",
                "year": "2009",
                "desc": "This paper presents three novel methods to efficiently generate and correlate sequence pairs with three zero correlation zones in the sum of their aperiodic correlation functions. These sequences have achieved great importance in communications systems when the maximum transmission delay is less than the length of these zones, because the multiple access interference (MAI) and the intersymbol interference (ISI) can be removed. The proposed algorithms are based on the properties of complementary sets of sequences (CSS) and they offer an efficient hardware implementation of the corresponding generators and correlators that reduces the total number of operations to be performed in comparison with straightforward implementations. That makes possible real-time operation as well as the use of very long sequences.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/abstract\/document\/4813245"
                ]
            },
            "publ010": {
                "title": "Characterization of an Underwater Positioning System Based on GPS Surface Nodes and Encoded Acoustic Signals",
                "authors": "Joaquín Aparicio, Ana Jiménez, Fernando J. Álvarez, Daniel Ruiz, Carlos De Marziani, Jesús Ureña, ",
                "year": "2016",
                "desc": "This paper presents a characterization of an underwater positioning system based on surface nodes equipped with GPS and acoustic transducers. The positioning system calculates the coordinates of an underwater vehicle in one of the surface nodes or beacons, by the emission, detection, and reply of acoustic encoded signals. The characterization of the system has been performed by means of a statistical study, considering different numbers of beacons, beacons' position and physical phenomena, such as noise, multipath, and Doppler spread. The error propagation caused by these phenomena and the geometrical configuration of the system has been quantitatively assessed in different positioning algorithms, based on trilateration and iterative procedures. The results show how the different phenomena affect the vehicle estimated position errors for the different positioning algorithms. In addition, the obtained errors inside the projected area of the beacons are ~1 m or lower, rising to a few meters for the worst case scenario, showing the feasibility of the acoustic positioning system.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/abstract\/document\/7469873"
                ]
            },
            "publ011": {
                "title": "Accurate detection of spread-spectrum modulated signals in reverberant underwater environments",
                "authors": "Joaquín Aparicio, Ana Jiménez, Fernando J. Álvarez,  Jesús Ureña,  Carlos De Marziani, Daniel De Diego, Nuno Cruz, Helder Campos",
                "year": "2015",
                "desc": "In those positioning systems based on the detection of acoustic signals, an accurate detection of the arrival times is crucial for a correct estimation of the distance between nodes, and therefore, for the precise estimation of the node that wants to be located. In order to obtain this arrival time more accurately, acoustic signals can be coded using pseudorandom noise, but these coded signals are still affected by underwater channel phenomena. In this work, the detection of spread-spectrum modulated signals is analyzed in underwater environments that are highly affected by multipath and reverberation. A spread-spectrum signal, which consist of a modulated Kasami code, has been emitted through two different pools, reaching a receiver where it has been captured after following several line-of-sight and non-line-of-sight paths. Then, a correlation process has been performed offline to provide information about the arrival times (times-of-flight) that form the multipath structure. These times-of-flight are compared with those provided by an underwater acoustic propagation model, in order to test the performance of this model and its capacity to predict the outcome of signal detection in underwater environments with a strong multipath and reverberation component. That way, the validated propagation model could be later used in future studies to predict the detection of spread-spectrum signals and the performance of systems that use them in these adverse environments.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0003682X14002096"
                ]
            },
            "publ012": {
                "title": "EMFi-Based Ultrasonic Sensory Array for 3D Localization of Reflectors Using Positioning Algorithms",
                "authors": "Ana Jiménez Martín, Álvaro Hernández Alonso, Daniel Ruíz, Isaac Gude, Carlos de Marziani, María Carmen Pérez, Fernando J. Álvarez, César Guitiérrez, Jesús Ureña",
                "year": "2015",
                "desc": "This paper describes a first prototype of an airborne ultrasonic array that combines pulse-compression techniques with positioning algorithms in order to achieve accurate determination of the position of the reflectors placed in front of the array. The new sensory system is based on an array with four independently controlled emitters and a receiver. The emitters are made of ferroelectrets as active material, leveraging their features to produce broadband air-coupled ultrasonic transducers at low cost. The ultrasonic emissions are encoded with an orthogonal Kasami sequence for each transducer, making possible to transmit simultaneously from each one. Furthermore, one of the main novelties of the proposal is that reflectors are located by means of a spherical trilateration algorithm that uses the time-of-flight of the ultrasonic signals from each transmitter to the receiver, bounced back by the reflector.",
                "authors_ref": "",
                "section": "publications",
                "links": [
                    "https:\/\/ieeexplore.ieee.org\/document\/6994821"
                ]
            }
        },
        "sections": [
            {
                "title": "Publicaciones",
                "id": "publications",
                "headers": {
                    "year": true,
                    "title": true,
                    "desc": true,
                    "authors": true,
                    "links": true
                },
                "content": [
                    "publ01",
                    "publ02",
                    "publ03",
                    "publ04",
                    "publ05",
                    "publ06",
                    "publ07",
                    "publ08",
                    "publ09",
                    "publ010",
                    "publ011",
                    "publ012"
                ]
            },
            {
                "title": "Proyectos",
                "id": "projects",
                "headers": {
                    "year": true,
                    "title": true,
                    "desc": false,
                    "authors": false,
                    "links": true
                },
                "content": [
                    "pro01"
                ]
            },
            {
                "title": "Transferencias",
                "id": "transfers",
                "headers": {
                    "year": true,
                    "title": true,
                    "desc": true,
                    "authors": true
                },
                "content": [
                    "transf01"
                ]
            },
            {
                "title": "Reportes internos",
                "id": "internal",
                "headers": {
                    "year": true,
                    "title": true,
                    "desc": false,
                    "authors": true
                },
                "content": [
                    "ir01"
                ]
            },
            {
                "id": "divider"
            },
            {
                "title": "Tesis de maestría",
                "id": "master",
                "headers": {
                    "year": true,
                    "title": true,
                    "desc": true,
                    "authors": true
                },
                "content": [
                    "mt01"
                ]
            },
            {
                "title": "Tesis doctorales",
                "id": "doctoral",
                "headers": {
                    "year": true,
                    "title": true,
                    "desc": true,
                    "authors": true,
                    "links": true
                },
                "content": [
                    "dt01",
                    "dt02"
                ]
            }
        ]
    },
    "recent": {
        "projects": [],
        "sections": {
            "sec1": []
        }
    }
}